In [1]:
from numpy import *
from pandas import *

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
dic1={'서울':800, '부산':2000, '대구':500}
dic2={'서울':[800], '부산':[2000], '대구':[500]}
#dic1, dic2

In [3]:
pd1=pd.Series(dic1);pd1  # 1차원

서울     800
부산    2000
대구     500
dtype: int64

In [4]:
pd2=pd.Series(dic2);pd2 # 1차원

서울     [800]
부산    [2000]
대구     [500]
dtype: object

In [5]:
#pd3=pd.DataFrame(dic1);pd3
## 2차원 데이터프레임은 딕셔너리의 value값이 반드시 리스트여야 함

In [6]:
pd4=pd.DataFrame(dic2);pd4
# 딕셔너리의 키값이 열의 제목이 됨. 
# 딕셔너리의 value값이 열의 값이 됨

    서울    부산   대구
0  800  2000  500

In [7]:
dic3={'서울':[800, 200, 500], '부산':[2000, 400, 300], '대구':[500, 4,0]}
pd5=pd.DataFrame(dic3);pd5

    서울    부산   대구
0  800  2000  500
1  200   400    4
2  500   300    0

In [8]:
pd6=pd.DataFrame(dic3, index=['car', 7.2, '동아'] );pd6

      서울    부산   대구
car  800  2000  500
7.2  200   400    4
동아   500   300    0

In [9]:
dic4={'city':   ['서울',  '부산',  '대전', '대구',  '광주'],
        'year': [2017,    2017,   2020,    2022,   2025],
        'temp': [18,       20,      19,    21,      16]  }

In [10]:
pd7=pd.Series(dic4);pd7

city              [서울, 부산, 대전, 대구, 광주]
year    [2017, 2017, 2020, 2022, 2025]
temp              [18, 20, 19, 21, 16]
dtype: object

In [11]:
pd8=pd.DataFrame(dic4);pd8
# 딕셔너리의 키이름 -> 데이터프레임의 열제목
# 딕셔너리의 value값 -> 데이터프레임의 행에 열값에 해당하는 값
# 인덱스는 자동으로 0부터 1씩 증가

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2020    19
3   대구  2022    21
4   광주  2025    16

In [12]:
type(pd7) , type(pd8)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [13]:
pd8[ ['temp', 'city','year' ] ] 
## 실제 데이터의 열 위치가 변경된것이 아니고, 보여만 줌

   temp city  year
0    18   서울  2017
1    20   부산  2017
2    19   대전  2020
3    21   대구  2022
4    16   광주  2025

In [14]:
pd8

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2020    19
3   대구  2022    21
4   광주  2025    16

In [15]:
pd9 = pd8[ ['temp', 'city','year' ] ] 
# 열들의 위치를 변경한 값을 저장하고 싶다면 변수=~~~
pd9

   temp city  year
0    18   서울  2017
1    20   부산  2017
2    19   대전  2020
3    21   대구  2022
4    16   광주  2025

In [16]:
pd8['city']  # 1개의 열만 출력은 [] 1번 사용

0    서울
1    부산
2    대전
3    대구
4    광주
Name: city, dtype: object

In [17]:
pd8[ [ 'city', 'year'] ] # 2개 이상의 열 출력은 [] 2번 사용

  city  year
0   서울  2017
1   부산  2017
2   대전  2020
3   대구  2022
4   광주  2025

In [18]:
pd8

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2020    19
3   대구  2022    21
4   광주  2025    16

In [19]:
pd8.index=['a','b','c','d','e']
pd8

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2020    19
d   대구  2022    21
e   광주  2025    16

In [20]:
pd8.columns=['도시','연도','날씨'];pd8

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2020  19
d  대구  2022  21
e  광주  2025  16

In [21]:
#pd8['city']   이미 city가 도시로 변경이 됨
pd8['도시'], pd8.도시

(a    서울
 b    부산
 c    대전
 d    대구
 e    광주
 Name: 도시, dtype: object,
 a    서울
 b    부산
 c    대전
 d    대구
 e    광주
 Name: 도시, dtype: object)

In [22]:
pd8.loc['b']  ## 인덱스값으로 접근

도시      부산
연도    2017
날씨      20
Name: b, dtype: object

In [23]:
b=pd8.loc['b'] 
type(b)

pandas.core.series.Series

In [24]:
e=pd8.도시
type(e)

pandas.core.series.Series

In [25]:
f=pd8[ ['도시','연도']]
type(f)

pandas.core.frame.DataFrame

In [26]:
pd8.loc['b' :]

   도시    연도  날씨
b  부산  2017  20
c  대전  2020  19
d  대구  2022  21
e  광주  2025  16

In [27]:
pd8.loc[ : 'c']

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2020  19

In [28]:
pd8.loc[ 'b': 'd']

   도시    연도  날씨
b  부산  2017  20
c  대전  2020  19
d  대구  2022  21

In [29]:
pd8.loc[ 'd': 'b']

Empty DataFrame
Columns: [도시, 연도, 날씨]
Index: []

In [30]:
pd8.loc [ [ 'c' , 'e' ] ]

   도시    연도  날씨
c  대전  2020  19
e  광주  2025  16

In [31]:
pd8.loc [ [ 'e' , 'c' ] ]

   도시    연도  날씨
e  광주  2025  16
c  대전  2020  19

In [32]:
pd8

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2020  19
d  대구  2022  21
e  광주  2025  16

In [33]:
pd8.set_index("도시")  ## 도시열을 인덱스로 값을 설정
#원본 변경이 안 됨.

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2020  19
대구  2022  21
광주  2025  16

In [34]:
pd8

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2020  19
d  대구  2022  21
e  광주  2025  16

In [35]:
pd9=pd8.set_index("도시")  ## 원본변경이 안 되므로 "변수="라는 방법을 활용
pd9

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2020  19
대구  2022  21
광주  2025  16

In [36]:
pd8.set_index("도시", inplace=True)  ## inplace=True : 원본이 변경

pd8

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2020  19
대구  2022  21
광주  2025  16

In [37]:
pd8.loc['광주']  ## 광주열만

연도    2025
날씨      16
Name: 광주, dtype: int64

In [38]:
pd8.loc['부산':'대구']  ## 부산~대구

      연도  날씨
도시
부산  2017  20
대전  2020  19
대구  2022  21

In [39]:
pd8.loc[ ['부산' , '대구'] ] ## 부산과 대구

      연도  날씨
도시
부산  2017  20
대구  2022  21

In [40]:
pd8.iloc[0], pd8.iloc[2:4], pd8.iloc[:3], pd8.iloc[2:],

(연도    2017
 날씨      18
 Name: 서울, dtype: int64,
       연도  날씨
 도시
 대전  2020  19
 대구  2022  21,
       연도  날씨
 도시
 서울  2017  18
 부산  2017  20
 대전  2020  19,
       연도  날씨
 도시
 대전  2020  19
 대구  2022  21
 광주  2025  16)

In [41]:
cars=[10,20,70,40,50]
pd8['자동차']=cars  ## 기존의 있는 열이름의 경우 수정
pd8['자동차2']=cars ## 기존의 없는 열이름의 경우 추가
pd8

      연도  날씨  자동차  자동차2
도시
서울  2017  18   10    10
부산  2017  20   20    20
대전  2020  19   70    70
대구  2022  21   40    40
광주  2025  16   50    50

In [42]:
pd8['자동차가치']=pd8.자동차 > 30
pd8

      연도  날씨  자동차  자동차2  자동차가치
도시
서울  2017  18   10    10  False
부산  2017  20   20    20  False
대전  2020  19   70    70   True
대구  2022  21   40    40   True
광주  2025  16   50    50   True

In [43]:
pd8.columns   ## 열 제목을 추출

Index(['연도', '날씨', '자동차', '자동차2', '자동차가치'], dtype='object')

In [44]:
pd8.describe()
# 데이터의 전체 통계값 출력 
#-> 갯수, 평균, 표준편차, 최소값, 25%-1사분위값, 2사분위값, 3사분위값, 최대

                연도         날씨        자동차       자동차2
count     5.000000   5.000000   5.000000   5.000000
mean   2020.200000  18.800000  38.000000  38.000000
std       3.420526   1.923538  23.874673  23.874673
min    2017.000000  16.000000  10.000000  10.000000
25%    2017.000000  18.000000  20.000000  20.000000
50%    2020.000000  19.000000  40.000000  40.000000
75%    2022.000000  20.000000  50.000000  50.000000
max    2025.000000  21.000000  70.000000  70.000000

In [45]:
pd.options.display.float_format='{:.3f}'.format

In [46]:
pd8.describe()

            연도     날씨    자동차   자동차2
count    5.000  5.000  5.000  5.000
mean  2020.200 18.800 38.000 38.000
std      3.421  1.924 23.875 23.875
min   2017.000 16.000 10.000 10.000
25%   2017.000 18.000 20.000 20.000
50%   2020.000 19.000 40.000 40.000
75%   2022.000 20.000 50.000 50.000
max   2025.000 21.000 70.000 70.000

In [47]:
pd8

      연도  날씨  자동차  자동차2  자동차가치
도시
서울  2017  18   10    10  False
부산  2017  20   20    20  False
대전  2020  19   70    70   True
대구  2022  21   40    40   True
광주  2025  16   50    50   True

In [48]:
cars2=['현대','기아','벤츠','동아','부산']
pd8['브랜드']=cars2
pd8

      연도  날씨  자동차  자동차2  자동차가치 브랜드
도시
서울  2017  18   10    10  False  현대
부산  2017  20   20    20  False  기아
대전  2020  19   70    70   True  벤츠
대구  2022  21   40    40   True  동아
광주  2025  16   50    50   True  부산

In [49]:
pd8.describe()  ## true, false인 자동차가치와 문자값인 브랜드는 로딩되지 않음.

            연도     날씨    자동차   자동차2
count    5.000  5.000  5.000  5.000
mean  2020.200 18.800 38.000 38.000
std      3.421  1.924 23.875 23.875
min   2017.000 16.000 10.000 10.000
25%   2017.000 18.000 20.000 20.000
50%   2020.000 19.000 40.000 40.000
75%   2022.000 20.000 50.000 50.000
max   2025.000 21.000 70.000 70.000

In [50]:
pd8.drop('자동차가치', axis=1)
# 열을 삭제하기 위해서는 열이름을 이용하여 axis=1 을 반드시 표기

      연도  날씨  자동차  자동차2 브랜드
도시
서울  2017  18   10    10  현대
부산  2017  20   20    20  기아
대전  2020  19   70    70  벤츠
대구  2022  21   40    40  동아
광주  2025  16   50    50  부산

In [51]:
pd8.drop('대전', axis=0)
# 행을 삭제하기 위해서는 인덱스값을 이용하여 axis=0 을 반드시 표기

      연도  날씨  자동차  자동차2  자동차가치 브랜드
도시
서울  2017  18   10    10  False  현대
부산  2017  20   20    20  False  기아
대구  2022  21   40    40   True  동아
광주  2025  16   50    50   True  부산

In [52]:
pd8=pd8.drop('자동차가치', axis=1)

In [53]:
pd8.drop('대전', axis=0, inplace=True)

In [54]:
pd8.sort_index()  ## 인덱스 값에 의해서 오름차순 정렬

      연도  날씨  자동차  자동차2 브랜드
도시
광주  2025  16   50    50  부산
대구  2022  21   40    40  동아
부산  2017  20   20    20  기아
서울  2017  18   10    10  현대

In [55]:
pd8.sort_index(axis=0) ## 인덱스 값에 의해서 오름차순 정렬 - axis 생략시 기본값이 0

      연도  날씨  자동차  자동차2 브랜드
도시
광주  2025  16   50    50  부산
대구  2022  21   40    40  동아
부산  2017  20   20    20  기아
서울  2017  18   10    10  현대

In [56]:
pd8.sort_index(axis=1) ## 열제목값으로 오름차순 정렬

    날씨 브랜드    연도  자동차  자동차2
도시
서울  18  현대  2017   10    10
부산  20  기아  2017   20    20
대구  21  동아  2022   40    40
광주  16  부산  2025   50    50

In [57]:
pd8

      연도  날씨  자동차  자동차2 브랜드
도시
서울  2017  18   10    10  현대
부산  2017  20   20    20  기아
대구  2022  21   40    40  동아
광주  2025  16   50    50  부산

In [58]:
pd8.sort_index(axis=1, inplace=True) ## 열제목값으로 오름차순 정렬

In [59]:
pd8

    날씨 브랜드    연도  자동차  자동차2
도시
서울  18  현대  2017   10    10
부산  20  기아  2017   20    20
대구  21  동아  2022   40    40
광주  16  부산  2025   50    50

In [60]:
pd8=pd8.sort_index(axis=0) 
pd8

    날씨 브랜드    연도  자동차  자동차2
도시
광주  16  부산  2025   50    50
대구  21  동아  2022   40    40
부산  20  기아  2017   20    20
서울  18  현대  2017   10    10

In [61]:
pd8.sort_index(axis=0, ascending=True)

    날씨 브랜드    연도  자동차  자동차2
도시
광주  16  부산  2025   50    50
대구  21  동아  2022   40    40
부산  20  기아  2017   20    20
서울  18  현대  2017   10    10

In [62]:
pd8.sort_index(axis=0, ascending=False)

    날씨 브랜드    연도  자동차  자동차2
도시
서울  18  현대  2017   10    10
부산  20  기아  2017   20    20
대구  21  동아  2022   40    40
광주  16  부산  2025   50    50

In [63]:
pd8.sort_values('날씨')

    날씨 브랜드    연도  자동차  자동차2
도시
광주  16  부산  2025   50    50
서울  18  현대  2017   10    10
부산  20  기아  2017   20    20
대구  21  동아  2022   40    40

In [64]:
pd8.sort_values('날씨', ascending=False)

    날씨 브랜드    연도  자동차  자동차2
도시
대구  21  동아  2022   40    40
부산  20  기아  2017   20    20
서울  18  현대  2017   10    10
광주  16  부산  2025   50    50

In [65]:
pd8.sort_values('날씨', ascending=False, inplace=True)

In [66]:
pd8.head(2)

    날씨 브랜드    연도  자동차  자동차2
도시
대구  21  동아  2022   40    40
부산  20  기아  2017   20    20

In [67]:
pd8.tail(2)

    날씨 브랜드    연도  자동차  자동차2
도시
서울  18  현대  2017   10    10
광주  16  부산  2025   50    50

In [68]:
def fun1(x):
    k=x.max()-x.min()
    return k
    
def fun2(x):
    return x.max()-x.min()

fun3 = lambda x : x.max()-x.min()
#람다식 : 간단한 함수를 수식으로 처리
# 함수이름 = lambda 매개변수 : 함수내용

In [69]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), 
                  columns=['AA', 'CC', 'BB', 'DD'], 
                  index = ['가가', '다다', '나나'] )
df

    AA  CC  BB  DD
가가   0   1   2   3
다다   4   5   6   7
나나   8   9  10  11

In [70]:
df.apply(fun1)

AA    8
CC    8
BB    8
DD    8
dtype: int64

In [71]:
df.apply(fun2)

AA    8
CC    8
BB    8
DD    8
dtype: int64

In [72]:
df.apply(fun3)

AA    8
CC    8
BB    8
DD    8
dtype: int64

In [73]:
df.apply(fun1, axis=0)  ## axis=0 열단위로 처리하는 기본

AA    8
CC    8
BB    8
DD    8
dtype: int64

In [74]:
df.apply(fun1, 1)

가가    3
다다    3
나나    3
dtype: int64

In [75]:
df.apply(fun2, axis=1)

가가    3
다다    3
나나    3
dtype: int64

In [76]:
df.apply(fun3, axis=1)

가가    3
다다    3
나나    3
dtype: int64

In [77]:
df2=pd.Series([10, 20, 30, 5, -4])
df2

0    10
1    20
2    30
3     5
4    -4
dtype: int64

In [78]:
df2.rank()

0   3.000
1   4.000
2   5.000
3   2.000
4   1.000
dtype: float64

In [79]:
df2.rank(ascending=False)

0   3.000
1   2.000
2   1.000
3   4.000
4   5.000
dtype: float64

In [80]:
df3=pd.Series([10, 10, 30, 5, -4])
print(df3)
df3.rank()  ## 3~4등이 존재 -> 3.5등이 됨

0    10
1    10
2    30
3     5
4    -4
dtype: int64

0   3.500
1   3.500
2   5.000
3   2.000
4   1.000
dtype: float64

In [81]:
df4=pd.Series([10, 10, 10, 5, -4])
print(df4)
df4.rank()

0    10
1    10
2    10
3     5
4    -4
dtype: int64

0   4.000
1   4.000
2   4.000
3   2.000
4   1.000
dtype: float64

In [82]:
df4.rank(method='first')

0   3.000
1   4.000
2   5.000
3   2.000
4   1.000
dtype: float64

In [83]:
df4.rank(method='max')

0   5.000
1   5.000
2   5.000
3   2.000
4   1.000
dtype: float64

In [84]:
df4.rank(method='min')

0   3.000
1   3.000
2   3.000
3   2.000
4   1.000
dtype: float64

In [85]:
df4.rank(method='average')

0   4.000
1   4.000
2   4.000
3   2.000
4   1.000
dtype: float64

In [86]:
df4.rank(method='dense')

0   3.000
1   3.000
2   3.000
3   2.000
4   1.000
dtype: float64

In [87]:
df5=DataFrame({'b':[4,7,3,2], 'a':[8,9, 6, 5], 'c':[5,7,3,9]})
print(df5)
df5.rank()  ## axis=0이 기본값 -> 열기준으로

   b  a  c
0  4  8  5
1  7  9  7
2  3  6  3
3  2  5  9

      b     a     c
0 3.000 3.000 2.000
1 4.000 4.000 3.000
2 2.000 2.000 1.000
3 1.000 1.000 4.000

In [88]:
df5.rank(axis=1)

      b     a     c
0 1.000 3.000 2.000
1 1.500 3.000 1.500
2 1.500 3.000 1.500
3 1.000 2.000 3.000

In [89]:
df5.rank(1)

      b     a     c
0 1.000 3.000 2.000
1 1.500 3.000 1.500
2 1.500 3.000 1.500
3 1.000 2.000 3.000

In [90]:
df5.sum()

b    16
a    28
c    24
dtype: int64

In [91]:
df5.sum(0)

b    16
a    28
c    24
dtype: int64

In [92]:
df5.sum(1)

0    17
1    23
2    12
3    16
dtype: int64